Repository: TekyaygilFethi/FethiTekyaygil
Catalog: FethiTekyaygilWebsite.MVC/resources/Views.Shared.Components.Events._Events.*.resx
Languages: tr_tr

# BogaziciPanelExplanation
source: Been Panelist at Boğaziçi DataCamp '20 How Did They Break Into Machine Learning/Data Science Panel
tr_tr: Boğaziçi DataCamp '20 How Did They Break Into Machine Learning/Data Science Panelinde panelist oldum.

# BogaziciPanelTitle
source: Boğaziçi DataCamp '20 How Did They Break Into Machine Learning/Data Science Panel
tr_tr: Boğaziçi DataCamp '20 How Did They Break Into Machine Learning/Data Science Paneli

# BogaziciPythonEducationExplanation
source: Given Python education for 7 weeks under the RAS club of Boğaziçi
tr_tr: Boğaziçi'nin RAS kulübü altında 7 hafta süren bir Python eğitimi veriyorum.

# BogaziciPythonEducationPosition
source: Educator
tr_tr: Eğitmen

# BogaziciPythonEducationTitle
source: Boğaziçi RAS Club Python Education
tr_tr: Boğaziçi RAS Kulübü Python Eğitimi

# Continue
source: Still continue
tr_tr: Devam Ediyor

# DeFactoEducationExplanation
source: I gave a Python, Data Science & ML Education for 6 weeks at DeFacto Technology. I had to end my training early due to leaving my job.
tr_tr: DeFacto Teknoloji'de 6 hafta süren bir Python, Veri Bilimi & ML Eğitimi verdim. İşten ayrılış sebebiyle eğitimlerimi erken sonlandırmak zorunda kaldım.

# DeFactoEducationPosition
source: Educator
tr_tr: Eğitmen

# DeFactoEducationTitle
source: DeFacto Technology - Python, Veri Bilimi & ML Education
tr_tr: DeFacto Teknoloji - Python, Veri Bilimi & ML Eğitimi

# DSEEducationExplanation
source: Within Data Science Earth, I'm giving educations of Python, Data Science & Machine Learning
tr_tr: Data Science Earth bünyesinde Python, Veri Bilimi ve Makine Öğrenmesi Eğitimleri veriyorum.

# DSEEducationPosition
source: Educator
tr_tr: Eğitmen

# DSEEducationTitle
source: Data Science Earth - Python, Data Science & ML Education
tr_tr: Data Science Earth - Python, Veri Bilimi & ML Eğitimi

# GAHPythonEducationExplanation
source: Been educator at 1 week Global AI Hub Python Education Series
tr_tr: Global AI Hub Python Eğitimlerinde 1 hafta eğitmenlik yaptım

# GAHPythonEducationPosition
source: Educator
tr_tr: Eğitmen

# GAHPythonEducationTitle
source: Global AI Hub Python Education
tr_tr: Global AI Hub Python Eğitimi

# KMMExplanation
source: Been mentor at Kaggle Master Program
tr_tr: Kaggle Master Programında mentor oldum

# KMMTitle
source: Kaggle Master Program
tr_tr: Kaggle Master Programı

# MindFusionExplanation
source: Been speaker at MindFusion Let's Talk Technology event
tr_tr: MindFusion - Teknoloji Konuşalım etkinliğinde konuşmacı oldum.

# MindFusionPosition
source: Speaker
tr_tr: Konuşmacı

# MindFusionTitle
source: MindFusion - Let's Talk Technology
tr_tr: MindFusion - Teknoloji Konuşalım
