Repository: TekyaygilFethi/FethiTekyaygil
Catalog: FethiTekyaygilWebsite.MVC/resources/Views.Shared.Components.Projects._Projects.*.resx
Languages: tr_tr

# AydinUniversityStudentPortalTitle
source: Aydın University Student Portal
tr_tr: Aydın Üniversitesi Öğrenci Portalı

# CatchCrazeExplanation
source: An Android and iOs game that based on timing and reflexes developed via using Unity and C#.
tr_tr: Unity ve C# kullanılarak geliştirilmiş reflekslere ve zamanlamaya dayalı Android ve iOs oyunu

# FTExplanation
source: This website developed via using ASP.NET CORE ve JQuery.
tr_tr: Bu websitesi ASP.NET CORE ve JQuery kullanılarak kodlanmıştır.

# FTWebsiteTitle
source: Fethi Tekyaygil Website
tr_tr: Fethi Tekyaygil Websitesi

# GuessProjectExplanation
source: Guess Game is a console application that expect a prediction of pre-defined number by a system from user and give feedbacks about these predictions to increase prediction accuracy.
tr_tr: Tahmin oyunu önceden sistem tarafından belirlenmiş bir sayıyı kullanıcıya tahmin ettirme ve bu tahminler sonucu geri dönütler vererek tahmin doğruluğunu arttırarak tahmmin ettiren bir konsol uygulamasıdır.

# GuessProjectTitle
source: Number Guess Game
tr_tr: Tahmin Oyunu

# IdeconCashflowProjectExplanation
source: This application is a Cashflow web application developed via using ASP.NET MVC CORE WebAPI technology that allows companies and firms to track their Cashflow, making simulations as desired and preview the future predictions for next dates. For the database, MySQL is used and Dapper ORM is used for Data Access Layer.
tr_tr: Firmaların Nakit Akışı kontrollerini gerçekleştirmek, isteğe göre simülasyon yapabilecekleri ve ileriki tarihler için tahminleri görebilecekleri bir Nakit Akışı ASP.NET MVC CORE Web API web uygulaması. Veritabanı için MySQL ve Veriye erişim katmanı için Dapper ORM kullanılmıştır.

# IdeconCashflowProjectTitle
source: Idecon Cashflow Project
tr_tr: Nakit Akışı Projesi

# IdeconExpenseProjectExplanation
source: An IDECON application that can create expense records, send them to approval and manage them that supports invoice read from image in order to allow personnels to execute their expense operations much faster. SignalR, .NET CORE, Dapper technologies and N-Tier architecture had used at the backend of the project which is developed by me.
tr_tr: Firma personellerinin masraf işlemlerini daha hızlı yapabilmeleri adına fiş okuma destekli masraf kaydı oluşurabilen, onaya sunabilen ve yönetilebilen bir IDECON uygulaması. Projenin benim geliştirdiğim backend kısmında SignalR, .NET CORE, Dapper teknolojileri kullanılarak katmanlı mimari ile geliştirme yapılmıştır.

# IdeconExpenseProjectTitle
source: Idecon Personnel Expense Project
tr_tr: Idecon Personel Masraf Projesi

# NQueenExplanation
source: NQueens Problem application is Winforms application that solves NQueens problem with DFS algorithm and takes Queen count from user as input.
tr_tr: NQueens Problemi uygulaması, Yapay Zeka problemlerinden biri olan NQueens problemini DFS algoritmasıyla çözen ve kullanıcıdan belli bir vezir sayısı alarak bunu gerçekleştiren Winforms uygulamasıdır.

# NQueenTitle
source: NQueens Problem
tr_tr: NQueen Problemi

# ProjectsSourceCodes
source: See Source Codes
tr_tr: Kaynak Kodları Görüntüle

# PythonExpenseProjectExplanation
source: A web service for companies' and firms' personels' expense processes developed via using Python Flask Framework and Spacy library with the purpose of Machine Learning. Application parses the info from an image of invoices and record it to database. Google OCR Api is used for reading the content of the image, Spacy NeR technology is used for these data's learning. MySQL is used for the database, SQLAlchemy is used for Data Access Layer.
tr_tr: Firmaların personellerinin masraf işlemleri için Python Flask Framework ve Makine Öğrenmesi amacıyla Spacy Kütüphanesi kullanılarak geliştirilen web servis. Uygulama resmi çekilen fişlerin içinden gerekli bilgileri ayıklayıp bu bilgileri veritabanına kaydetmektedir. Resim okumak için Google OCR apisi, bu verilerin öğrenimi için de Spacy NeR teknolojisi kullanılmaktadır. Veritabanı için MySQL, veriye erişim katmanı için de SQLAlchemy kullanılmaktadır.

# PythonExpenseProjectTitle
source: Expense Project
tr_tr: Masraf Projesi

# ShowAS
source: See on App Store
tr_tr: App Store'da Görüntüle

# ShowPS
source: See on Play Store
tr_tr: Play Store'da Görüntüle

# SpinNTossExplanation
source: An Android and iOs game that based on timing and reflexes developed via using Unity and C#.
tr_tr: Unity ve C# kullanılarak geliştirilmiş reflekslere ve zamanlamaya dayalı Android ve iOs oyunu

# XOXExplanation
source: Winforms aplication of classic Tic Tac Toe game that plays on 3x3 plane which contains Min-Max Algorithm and which's difficulty can be set.
tr_tr: Zorluk derecesi ayarlanabilen, 3x3 lük bir düzlemde oynanan klasik X O X oyununun Min-Max algoritması ile Winforms için geliştirildiği uygulama.

# XOXTitle
source: Tic Tac Toe
tr_tr: X O X
