Repository: TekyaygilFethi/FethiTekyaygil
Catalog: FethiTekyaygilWebsite.MVC/resources/Views.Shared.Components.Timeline._Timeline.*.resx
Languages: tr_tr

# AltinbasAddress
source: Mahmutbey, Mahmutbey Dilmenler District Mahmutbey Campus No:26, 34218 Bağcılar/İstanbul
tr_tr: Mahmutbey, Mahmutbey Dilmenler Caddesi Mahmutbey Yerleşkesi No:26, 34218 Bağcılar/İstanbul

# AltinbasExplanation
source: I started my university life with Kemerburgaz University Computer Engineering Department which I've won with 75% scholarship at 2014. During my education life at university which renamed as "Altınbaş" University, I've seen and experienced many vocatinal, social areas and had the chance of improving myself and my skills.<br/><i class="fas fa-arrow-right"></i>Vocational Lessons:<br/><i class="fas fa-arrow-right" style="padding-left:5em"></i> Relational Database Management Systems Course<br/><i class="fas fa-arrow-right" style="padding-left:5em"></i>Software Engineering Course<br/><i class="fas fa-arrow-right" style="padding-left:5em"></i>C Course<br/><i class="fas fa-arrow-right" style="padding-left:5em"></i>Java OOP Course<br/><i class="fas fa-arrow-right" style="padding-left:5em"></i>Algorithms Course<br/><i class="fas fa-arrow-right" style="padding-left:5em"></i>Operationg Systems Course<br/><i class="fas fa-arrow-right" style="padding-left:5em"></i>Artificial Intelligence Course<br/><i class="fas fa-arrow-right" style="padding-left:5em"></i>Web Services Course<br/><i class="fas fa-arrow-right" style="padding-left:5em"></i>Web Technologies Course<br/><br/>Projects:<br/><i class="fas fa-arrow-right" style="padding-left:5em"></i> NQueens Winforms Puzzle via using DFS Algorithm for Artificial Intelligence Course<br/><i class="fas fa-arrow-right" style="padding-left:5em"></i> TicTacToe Winforms game via using Min-Max Algorithm for Artificial Intelligence Course<br/><i class="fas fa-arrow-right" style="padding-left:5em"></i> Last Man Standing C# Console game for Artifical Intelligence Course<br/><i class="fas fa-arrow-right" style="padding-left:5em"></i> Shopping Site via using ASP.NET MVC and Entity Framework for Web Technologies Course<br/><i class="fas fa-arrow-right" style="padding-left:5em"></i> - For Design Project, A Student System that contains Forum, Grade Calculation and Screen Sharing features developed as ASP.NET MVC, WCF Service ans Winform Projects:<br><i class="fas fa-arrow-right" style="padding-left:10em"></i>Entity Framework Code First, Generic Repository and Unit Of Work Patterns are used for database management operations.<br/><i class="fas fa-arrow-right" style="padding-left:10em"></i>Bootstrap, JQuery, AJAX is used for front-end solutions <br/>
tr_tr: 2014 yılında %75 bursla kazandığım Kemerburgaz Üniversitesi Bilgisayar Mühendisliği bölümüyle beraber üniversite hayatına giriş yaptım. Eğitim hayatım süresince ismini Altınbaş Üniversitesi olarak değiştiren okulumda kendimi mesleki ve sosyal alanlarda geliştirme fırsatına eriştim.<br/><i class="fas fa-arrow-right"></i>Mesleki Dersler:<br/><i class="fas fa-arrow-right" style="padding-left:5em"></i>İlişkisel Veritabanı Dersi<br/><i class="fas fa-arrow-right" style="padding-left:5em"></i>Yazılım Mühendisliği Dersi<br/><i class="fas fa-arrow-right" style="padding-left:5em"></i>C Dersi<br/><i class="fas fa-arrow-right" style="padding-left:5em"></i>Java OOP Dersi<br/><i class="fas fa-arrow-right" style="padding-left:5em"></i>Algoritmalar Dersi<br/><i class="fas fa-arrow-right" style="padding-left:5em"></i>İşletim Sistemleri Dersi<br/><i class="fas fa-arrow-right" style="padding-left:5em"></i>Yapay Zeka Dersi<br/><i class="fas fa-arrow-right" style="padding-left:5em"></i>Web Servisleri Dersi<br/><i class="fas fa-arrow-right" style="padding-left:5em"></i>Web Teknolojileri Dersi<br/><br/><i class="fas fa-arrow-right"></i>Projeler:<br/><i class="fas fa-arrow-right" style="padding-left:5em"></i>DFS Algoritması kullanılarak çözülen NQueens Winforms uygulaması.(Yapay Zeka Dersi)<br/><i class="fas fa-arrow-right" style="padding-left:5em"></i>Min - Max Algoritması kullanılarak oluşturulan TicTacToe Winforms uygulaması.(Yapay Zeka Dersi)<br/><i class="fas fa-arrow-right" style="padding-left:5em"></i>Last Man Standing C# konsol uygulaması.(Yapay Zeka Dersi)</br><i class="fas fa-arrow-right" style="padding-left:5em"></i>ASP.NET MVC ile geliştirilmiş Alışveriş Sitesi.(Web Teknolojileri Dersi)<br/><i class="fas fa-arrow-right" style="padding-left:5em"></i> Bitirme Projesi için, Forum, Canlı Chat, Ekran Paylaşımı ve Not Hesaplama özelliklerini içeren uygulama:<br/><i class="fas fa-arrow-right" style="padding-left:10em"></i>Veritabanı için Entity Framework Code First teknolojisi kullanılırken, Generic Repository ve Unit Of Work Tasarımm Kalıpları kullanılmıştır.<br/><i class="fas fa-arrow-right" style="padding-left:10em"></i>Front - end geliştirme için Bootstrap, jQuery ve AJAX teknolojileri kullanıldı.

# AltinbasPosition
source: Computer Engineering Department Bachelor Student
tr_tr: Bilgisayar Mühendisliği Departmanı Lisans Öğrencisi

# AltinbasTitle
source: Kemerburgaz / Altınbaş University
tr_tr: Kemerburgaz / Altınbaş Üniversitesi

# BAALAddress
source: Bahçeşehir 2. Section, Şelale District, Ata Street No 3/2, 34538 Başakşehir/İstanbul
tr_tr: Bahçeşehir 2. Kısım, Şelale Caddesi, Ata Sokağı No 3/2, 34538 Başakşehir/İstanbul

# BAALExplanation
source: Ath 12th grade, I continued my education life at Bahçeşehir Atatürk Anatolian High School
tr_tr: 12.sınıfta eğitim hayatıma Bahçeşehir Atatürk Anadolu Lisesi'nde devam ettim.

# BAALPosition
source: High School Student
tr_tr: Lise Öğrencisi

# BAALTitle
source: Bahcesehir Ataturk Anatolian High School
tr_tr: Bahçeşehir Atatürk Anadolu Lisesi

# BahcelievlerAddress
source: Çobançeşme District Sanayi Street No: 48
tr_tr: Çobançeşme Mahallesi Sanayi Caddesi No: 48

# BahcelievlerExplanation
source: During my intern at IT Department of Bahçelievler Municipality, I had the chance of developing Fuel Track Winforms and Number Guess projects using Entity Framework, DevExpress and SQL technologies.<br/><i class="fas fa-arrow-right"></i>Developing Number Guess Project using C# Console Application.<br/><i class="fas fa-arrow-right"></i>Patricipated ASP.NET MVC projects.<br/><i class="fas fa-arrow-right"></i>Developed Fuel Tracking projects using Entity Framework ve WinForms.
tr_tr: Bahçelievler Belediyesi Bilgi-İşlem bölümünde yaptığım staj boyunca Entity Framework, DevExpress ve SQL teknolojilerini kullanarak Yakıt Takip Winforms projesi ve Sayı Tahmin oyunu geliştirme fırsatına eriştim.<br/><i class="fas fa-arrow-right"></i>C# Console Application projesiyle sayı tahmin oyunu yapımı.<br/><i class="fas fa-arrow-right"></i>ASP.NET MVC projelerinde bulunuldu.<br/><i class="fas fa-arrow-right"></i>Entity Framework ve WinForms kullanılarak Yakıt Takip uygulaması geliştirildi.<br/>

# BahceliEvlerPosition
source: .NET Developer Intern
tr_tr: .NET Geliştirici Stajyeri

# BahcelievlerTitle
source: Bahçelievler Municipality
tr_tr: Bahçelievler Belediyesi

# Continue
source: Still continue
tr_tr: Devam Ediyor

# DeFactoExplanation
source: In DeFacto, I am currently developing ASP.NET CORE and Angular projects to HR department.
tr_tr: DeFacto bünyesindeki IK departmanına Angular ve ASP.NET CORE kullanarak yazılımlar geliştirmekteyim.

# DeFactoPosition
source: Junior .NET Specialist
tr_tr: Junior .NET Uzmanı

# DeFactoTitle
source: DeFacto Technology
tr_tr: DeFacto Teknoloji

# EAIOAddress
source: Esenkent, Enver Paşa District Onur Güvener Street No:1, 34510 Esenyurt/İstanbul
tr_tr: Esenkent, Enver Paşa Caddesi Onur Güvener Sokak No:1, 34510 Esenyurt/İstanbul

# EAIOExplanation
source: I successfully graduated from Esenkent Atatürk Primary School which I transferred at the end of the first semester.<br/><b>Gained Certificates:</b><font color="red"><i><br/> <i class="fas fa-arrow-right" style="padding-left:5em"></i> Honour Certificate at both of the semesters.</i></font>
tr_tr: 8.sınıfın ilk yarısının sonlarına doğru geçtiğim Esenkent Atatürk İlköğretim okulundan başarıyla mezun olup lise hayatının temellerini sağlam attım.<br/><b>Aldığım Belgeler:</b><font color="red"><i><br/> <i class="fas fa-arrow-right" style="padding-left:5em"></i> İki dönemde de Onur Belgesi.</i></font>

# EAIOPosition
source: Primary School Student
tr_tr: İlköğretim Öğrencisi

# EAIOTitle
source: Esenkent Atatürk Primary School
tr_tr: Esenkent Atatürk İlköğretim Okulu

# GGSoftAddress
source: İçerenköy, Kartal Street No:19, 34752 Ataşehir/İstanbul
tr_tr: İçerenköy, Kartal Sokak No:19, 34752 Ataşehir/İstanbul

# GGSoftExplanation
source: Participated development of Paperwork product and ASP.NET MVC projects in that company which develops software with .NET technologies<br/><i class="fas fa-arrow-right"></i>Development of Paperwork product.<br/><i class="fas fa-arrow-right"></i>Font Viewer ASP.NET MVC projects.<br/><i class="fas fa-arrow-right"></i>Participated Paperwork product's conversion to Silverlight tp ASP.NET MVC.<br/>
tr_tr: .NET teknolojileri ile yazılım geliştiren şirkette ASP.NET MVC projeleri ve kendi yazılımları olan Paperwork ürününün geliştirmesinde bulundum.<br/><i class="fas fa-arrow-right"></i>Paperwork ürününün geliştirilmesi.<br/><i class="fas fa-arrow-right"></i>Font görüntüleyici ASP.NET MVC uygulaması.<br/><i class="fas fa-arrow-right"></i>Paperwork ürününün Silverlight'tan MVC'ye çevrilmesinde katıda bulunuldu.<br/>

# GGSoftPosition
source: .NET Developer
tr_tr: .NET Geliştirici

# IdeconAddress
source: Oruç Reis District Tekstilkent Street No: 12 Koza Plaza A Blok Floor:14 Apartment: 51, 34235 Esenler
tr_tr: Oruç Reis Mahallesi Tekstilkent Caddesi No: 12 Koza Plaza A Blok Kat:14 Daire: 51, 34235 Esenler

# IdeconExplanation
source: I 've developed softwares by combining different technologies and set ups to servers at IDECON company which is a solution partner at Electronic Conversion Processes.<br/><i class="fas fa-arrow-right"></i>Developed Cashflow project using ASP.NET MVC Web API CORE and Dapper<br/><i class="fas fa-arrow-right"></i>Developing "Expense" project that contains OCR reading and maching learning using Python Flask Framework, Google OCR and Spacy library.<br/><i class="fas fa-arrow-right"></i>Setting up and maintaining the eReconciliation and eStatement applications to our client companies' servers..<br/>
tr_tr: Elektronik Dönüşüm Süreçlerinde çözüm ortağı olan IDECON firmasında kurulumlar ve bir çok teknolojiyi harmanlayarak yazılım geliştirmeleri yapmaktayım.<br/><i class="fas fa-arrow-right"></i>ASP.NET MVC Web API CORE ve Dapper kullanılarak Nakit Akışı projesinin geliştirilmesi.<br/><i class="fas fa-arrow-right"></i>Pyhton Flask Framework, Google OCR ve Spacy kütüphanesi kullanılarak makine öğrenmesi içeren OCR okumalı "Masraf" uygulaması geliştirilmesi<br/><i class="fas fa-arrow-right"></i>Emutabakat ve Elektronik Hesap Özeti uygulamalarının müşteri sunuuclarında kurulumlarının ve bakımlarının yapılması.<br/>

# IdeconPosition
source: Technology Consultant
tr_tr: Teknoloji Danışmanı

# IdeconTitle
source: IDECON Consultancy Services A.Ş.
tr_tr: IDECON Danışmanlık Hizmetleri A.Ş.

# NHIOAddress
source: Teşvikiye, Vali Konağı Distinct Şakayık Street No:50, 34365 Şişli/İstanbul
tr_tr: Teşvikiye, Vali Konağı Caddesi Şakayık Sokak No:50, 34365 Şişli/İstanbul

# NHIOExplanation
source: I started my education life at Nilüfer Hatun Primary School until first semester of 8th grade including the kidergarten.<br/><b>Gained Certificates:</b><i><br/> <i class="fas fa-arrow-right" style="padding-left:5em"></i> Participation certificate for attending 23th April National Sovereignty and Children's Day Event.<br/> <i class="fas fa-arrow-right" style="padding-left:5em"></i> Succession and participation certificate for school's social, educational and sportive events.<br/> <i class="fas fa-arrow-right" style="padding-left:5em"></i>)Participation certificate for reading contest named "10 Beautiful Piece".</i>
tr_tr: Anaokulu dahil ilk 8.sınıfın ilk yarısı da dahil Nilüfer Hatun İlköğretim okulunda eğitim hayatıma başladım.<br/><b>Aldığım Belgeler:</b><i><br/> <i class="fas fa-arrow-right" style="padding-left:5em"></i> 23 Nisan Ulusal Egemenlik ve Çocuk Bayramı Etkinliğine Katılım Belgesi.<br/> <i class="fas fa-arrow-right" style="padding-left:5em"></i> Okulun sosyal, eğitsel ve sportif etkinliklerinde gösterilen başarı ve sağlanılan katılım belgesi.<br/> <i class="fas fa-arrow-right" style="padding-left:5em"></i>"10 Güzel Eser" isimli kitap okuma yarışmasına katılım belgesi.</i>

# NHIOPosition
source: Primary School Student
tr_tr: İlköğretim Öğrencisi

# NHIOTitle
source: Nilüfer Hatun Primary School
tr_tr: Nilüfer Hatun İlköğretim Okulu

# OkyanusAddress
source: Esenkent, Talat Paşa District Yeşil Irmak Street No:1, 34510 Esenyurt/İstanbul
tr_tr: Esenkent, Talat Paşa Caddesi Yeşil Irmak Sokak No:1, 34510 Esenyurt/İstanbul

# OkyanusExplanation
source: Okyanus College gave me the chance of improve myself at software and hardware areas and also give me friendships that is durable forever as the first school of my high school education<br/><b>Gained Certificates:</b><br/><i class="fas fa-arrow-right" style="padding-left:5em"></i>2 Success Certificates.<br/><i class="fas fa-arrow-right" style="padding-left:5em"></i>Participation certificate to the event of "Walking on the podium with the most model." which takes place at 26th May 2012 at Ora Arena.<br/><i class="fas fa-arrow-right" style="padding-left:5em"></i>Participation certificate to English Drama Club<br/><i class="fas fa-arrow-right" style="padding-left:5em"></i>Participation certificate to Computer Club<br/>
tr_tr: Lise hayatım başladığım Okyanus Koleji bana hem kendimi yazılım ve donanım alanında geliştirebilme fırsatı hem de yeni ve temeli sağlam arkadaşlıklar kazandırdı.<br/><b>Aldığım Belgeler:</b><br /><i class="fas fa-arrow-right" style="padding-left:5em"></i>2 adet Başarı Belgesi.<br/><i class="fas fa-arrow-right" style="padding-left:5em"></i>26 Mayıs 2012 tarihli Ora Arena'da gerçekleştirilen <b>"En Fazla Model İle Podyuma Çıkma Guiness Rekoru"</b> etkinliğine katılım Belgesi.<br/><i class="fas fa-arrow-right" style="padding-left:5em"></i>İngilizce Drama Kulübü Katılım Belgesi.<br/><i class="fas fa-arrow-right" style="padding-left:5em"></i>Bilgisayar Kulübü Katılım Belgesi.

# OkyanusPosition
source: High School Student
tr_tr: Lise Öğrencisi

# OkyanusTitle
source: Okyanus College
tr_tr: Okyanus Koleji

# PragmasoftAddress
source: İçerenköy, Karaman Çiftliği Street Göksuyu Business Center No:64 Floor:3 Apartment:3, 34752 Ataşehir/İstanbul
tr_tr: İçerenköy, Karaman Çiftliği Caddesi Göksuyu İş Merkezi No:64 Kat:3 Daire:3, 34752 Ataşehir/İstanbul

# PragmasoftExplanation
source: During my intern at Pragmasoft company, I had the chance of developing ASP.NET MVC WebApi project to Samsung company.<br/><i class="fas fa-arrow-right"></i>Developed a contest application using ASP.NET MVC WebApi and Entity Framework. In that application, users gains participation chance to the contest when they upload the photo of Samsung products' invoices they bought from that new Samsung product or another Samsung product. After draw, gifts and promotions are given to the contestants.
tr_tr: Pragmasoft şirketinde yaptığım staj boyunca Samsung şirketine ASP.NET MVC Web Api projesi yapma şansını elde ettim.<br/><i class="fas fa-arrow-right"></i>Samsung için ASP.NET MVC WebApi ve Entity Framework kullanarak yarışma uygulaması geliştirildi. Uygulamada Samsung ürünleri alan kullanıcılar faturalarının resmini aldıkları cihaz veya herhangi bir Samsung cihazı üzerinden gönderdiklerinde çekilişe katılıyorlar. Çekiliş sonucunda ise hediyeler verilmektedir.

# PragmasoftPosition
source: .NET Developer Intern
tr_tr: .NET Geliştirici Stajyeri
